// 11. Напишите программу, которая проверяет, начинается ли строка str с гласной буквы. Гласными
// считаются: a, e, i, o, u. Выведите результат в консоль.
// Входные: str = "apple" → Результат: "Строка начинается с гласной"
// Входные: str = "banana" → Результат: "Строка не начинается с гласной"
// function BeginWith(str : string) : string{
//     return 'aeiou'.includes(str.split('')[0]) ? "Строка начинается с гласной" : "Строка не начинается с гласной"
// }
// console.log(BeginWith("fpple"));
