// 1. Напишите программу, которая проверяет, делится ли заданное число num на 3 и 5 одновременно.
// Если делится, выведите "Число делится на 3 и 5", иначе "Число не делится на 3 и 5".
// Входные: num = 15 → Результат: "Число делится на 3 и 5"
// Входные: num = 14 → Результат: "Число не делится на 3 и 5"
// function isDivided(num: number) : string{
//     if(num % 3 === 0 && num % 5 === 0) return "Число делится на 3 и 5"
//     return "Число не делится на 3 и 5"
// }
// console.log(isDivided(14));
