// 4. Создайте переменную строки. Напишите программу, которая определяет, содержит ли строка хотя
// бы одну цифру. Если да, выведите "Строка содержит цифры", иначе "Строка не содержит цифр".
// Входные: str = "Hello123" → Результат: "Строка содержит цифры"
// Входные: str = "Hello" → Результат: "Строка не содержит цифр"

// function isConsistedNum(str : string) : string{
//     for(let i = 0; i < str.length; i++){
//         if(!isNaN(Number(str[i]))) return "Строка содержит цифры"
//     }
//     return "Строка не содержит цифры"
// }
// console.log(isConsistedNum("Hello"));
