// 5. Напишите программу, которая проверяет, является ли число num2 квадратом числа num1.
// Выведите сообщение в консоль, указывающее результат проверки.
// Входные: num1 = 3, num2 = 9 → Результат: "9 является квадратом 3"
// Входные: num1 = 4, num2 = 20 → Результат: "20 не является квадратом 4"

// function isSquare(num1 : number, num2 : number) : string{
//     if(num1 * num1 == num2) return `${num2} является квадратом ${num1}`;
//     return `${num2} не является квадратом ${num1}`
// }
// console.log(isSquare(4,20));