// 6. Создайте две переменные, представляющие собой двузначные числа. Напишите программу,
// которая сравнивает сумму цифр каждого числа и выводит в консоль большее из двух чисел.
// Входные: num1 = 23, num2 = 56 → Результат: "56 имеет большую сумму цифр"
// Входные: num1 = 34, num2 = 25 → Результат: "Оба числа имеют одинаковую сумму цифр"

// function MaxSum(num1 : number, num2 : number) : string{
//     if((num1 % 10 + (num1 - num1 % 10) / 10) === (num2 % 10 + (num2 - num2 % 10) / 10)) return "Оба числа имеют одинаковую сумму цифр"
//     if((num1 % 10 + (num1 - num1 % 10) / 10) > (num2 % 10 + (num2 - num2 % 10) / 10)) return `${num1} имеет большую сумму цифр`
//     return `${num2} имеет большую сумму цифр`
// }
// console.log(MaxSum(23, 56));

