// 8. Напишите программу, которая принимает две строки str1 и str2 и проверяет, содержат ли они
// одинаковые символы (не обязательно в том же порядке). Выведите результат в консоль.
// Входные: str1 = "abc", str2 = "cba" → Результат: "Строки содержат одинаковые символы"
// Входные: str1 = "abc", str2 = "def" → Результат: "Строки не содержат одинаковые символы"

// function isSome(str1 : string, str2 : string) : string{
//     let flag = null;
//     for(let i = 0; i < str1.length; i++){
//         if(str2.includes(str1[i])) flag = true;
//         else flag = false
//     }
//     return flag ? "Строки содержат одинаковые символы" : "Строки не содержат одинаковые символы";
// }
// console.log(isSome("abc", "def"));
